
{
  "chapters": [
    {
      "title": "Quy trình quản lý dự án",
      "headings": [
        {
          "title": "Quy trình khởi động",
          "content": "Nhận diện và bắt đầu một dự án mới. Các kết quả chính gồm: Chọn người quản trị dự án, Xác định các stakeholders chính, Hoàn tất các nghiệp vụ (business case), Hoàn tất tuyên bố về dự án và lấy chữ ký.",
          "keywords": ["quy trình khởi động", "business case", "stakeholders"]
        },
        {
          "title": "Quy trình lập kế hoạch",
          "content": "Xác định các công việc và ước lượng tài nguyên, Sắp xếp thứ tự thực hiện các công việc, Chọn quy trình làm phần mềm, Dự đoán các rủi ro, biến cố trong tương lai và đưa ra giải pháp. Kết quả: Hợp đồng nhóm (team contract), Phát biểu về phạm vi dự án (scope statement), Biểu đồ phân rã công việc (WBS), Lịch biểu của dự án, dưới dạng biểu đồ Gantt với các tài nguyên sử dụng và các mối quan hệ phụ thuộc, Danh sách các rủi ro.",
          "keywords": ["quy trình lập kế hoạch", "WBS", "biểu đồ Gantt"]
        },
        {
          "title": "Quy trình thực thi",
          "content": "Thường chiếm nhiều thời gian và tài nguyên nhất để thực thi dự án vì sản phẩm của dự án được tạo ra trong giai đoạn này. Kết quả quan trọng nhất là kết quả công việc. Người quản trị dự án phải dùng kỹ năng lãnh đạo để vượt qua những thách thức xảy ra trong quá trình thực thi dự án.",
          "keywords": ["quy trình thực thi", "kết quả công việc"]
        },
        {
          "title": "Quy trình điều khiển",
          "content": "Điều khiển bao gồm đo tiến độ đạt được các mục tiêu của dự án, theo dõi độ lệch so với kế hoạch, và thực hiện các hoạt động chỉnh sửa cho phù hợp. Điều khiển tác động đến tất cả các nhóm quy trình khác và xảy ra trong tất cả các giai đoạn của chu trình sống dự án. Kết quả quan trọng của giai đoạn này là báo cáo tình trạng và báo cáo tiến độ.",
          "keywords": ["quy trình điều khiển", "báo cáo tiến độ"]
        },
        {
          "title": "Quy trình kết thúc",
          "content": "Quy trình kết thúc gồm đạt được sự chấp nhận của các stakeholder và khách hàng về sản phẩm và chuyển dự án sang trạng thái kết thúc. Cài đặt các kết quả của dự án, Huấn luyện sử dụng, Hoàn tất tài liệu, Chuẩn bị bảo hành, bảo trì, Thông báo kết thúc dự án. Ngay cả khi dự án chưa hoàn tất, nó cần phải kết thúc để rút kinh nghiệm, Tài liệu lưu trữ về dự án và các bài học kinh nghiệm là những kết quả quan trọng. Hầu hết các dự án có báo cáo và trình bày cuối cùng (final report and presentation).",
          "keywords": ["quy trình kết thúc", "bảo hành", "final report"]
        }
      ]
    },
    {
      "title": "Quản lý chất lượng",
      "headings": [ 
        {
        "title": "Khái niệm",
        "content": "Chất lượng là một sự tổng hợp tất cả các đặc tính của một sản phẩm mà có khả năng thỏa mãn mọi yêu cầu về sản phẩm đó (ISO). Một số chuyên gia định nghĩa chất lượng dựa trên mức độ đáp ứng của sản phẩm và sự phù hợp khi sử dụng. Sản phẩm đáp ứng được các yêu cầu, Có đủ các chức năng như quy định.",
        "keywords": ["khái niệm chất lượng", "ISO"],
        "subheadings": [
          {
            "title": "Tầm quan trọng của quản lý chất lượng",
            "content": "Đảm bảo dự án thỏa mãn mọi yêu cầu đã đề ra. Khách hàng là người cuối cùng đánh giá sản phẩm. Nhiều dự án thất bại do chỉ chú tâm đến kỹ thuật, mà không quan tâm đến mong đợi của khách hàng. Vấn đề chất lượng phải được xem ngang hàng với phạm vi dự án, thời gian thực hiện và chi phí.",
            "keywords": ["tầm quan trọng của quản lý chất lượng", "khách hàng"]
          },
          {
            "title": "Mối liên hệ giữa quản lý chất lượng và quản lý phạm vi",
            "content": "Quản lý phạm vi: xác định các ranh giới, yêu cầu của dự án, đảm bảo sự rõ ràng và sự phù hợp với kỳ vọng của các bên liên quan. Quản lý chất lượng: đảm bảo rằng các đầu ra của dự án đáp ứng các tiêu chuẩn đã được xác định, đảm bảo thành công của dự án. Nếu không có quản lý phạm vi rõ ràng, việc xác định tiêu chuẩn chất lượng sẽ gặp khó khăn, và nếu thiếu quản lý chất lượng, ngay cả phạm vi đã được định rõ ràng cũng có thể không dẫn đến kết quả hài lòng cho dự án.",
            "keywords": ["mối liên hệ giữa quản lý chất lượng và phạm vi", "tiêu chuẩn chất lượng"]
          }
        ]
      },
      {
        "title": "Quy trình quản lý chất lượng",
        "content": "Quản lý chất lượng gồm 3 quy trình:\n-Lập kế hoạch quản lý chất lượng\n-Thực hiện đảm bảo chất lượng\n-Kiểm soát chất lượng",
        "keywords": ["quy trình quản lý chất lượng"],
        "subheadings": [
          {
            "title": "Lập kế hoạch quản lý chất lượng",
            "content": "Là quy trình xác định yêu cầu chất lượng và/hoặc tiêu chuẩn chất lượng của dự án và các sản phẩm bàn giao. Lập tài liệu về việc dự án sẽ thực hiện như thế nào để đạt được các yêu cầu chất lượng. Lợi ích của quy trình này là cung cấp hướng dẫn và định hướng cho việc chất lượng sẽ được quản lý và công nhận như thế nào trong suốt dự án. Việc kết hợp tất cả các tiêu chuẩn chất lượng trong thiết kế dự án là mấu chốt quan trọng nhất trong quản lý chất lượng. Trong dự án CNTT, các tiêu chuẩn chất lượng cho phép hệ thống mở rộng và nâng cấp, đặt ra thời lượng thích hợp nhất để hệ thống xử lý dữ liệu và bảo đảm hệ thống cho kết quả chính xác và nhất quán.",
            "keywords": ["lập kế hoạch quản lý chất lượng", "tiêu chuẩn chất lượng", "dự án CNTT"]
          },
          {
            "title": "Thực hiện đảm bảo chất lượng",
            "content": "Đánh giá toàn bộ hoạt động của dự án nhằm đảm bảo dự án có thể thỏa mãn những tiêu chuẩn chất lượng có liên quan. Quy định rõ trách nhiệm về mặt chất lượng trong suốt quá trình thực hiện dự án. Lợi ích của quy trình này là nhằm cải tiến việc thực hiện dự án ở hiện tại hay những dự án trong tương lai.",
            "keywords": ["thực hiện đảm bảo chất lượng", "đánh giá hoạt động dự án"]
          },
          {
            "title": "Kiểm soát chất lượng",
            "content": "Là quy trình giám sát và kiểm tra các kết quả cụ thể của dự án nhằm đánh giá dự án có tuân thủ các quy định chất lượng hay không. Đồng thời đề nghị các cách đề cải thiện chất lượng. Lợi ích của quy trình này là: -Nhằm xác định nguyên nhân của các quy trình kém hay sản phẩm kém chất lượng để có hành động loại bỏ chúng -Công nhận các sản phẩm bàn giao và các công việc đã đạt được các yêu cầu của các bên liên quan để nghiệm thu dự án. Kết quả thu được của quá trình này: -Các quyết định chấp nhận (Acceptance decisions) -Làm lại (Rework) -Sửa đổi quy trình (Process adjustments)",
            "keywords": ["kiểm soát chất lượng", "giám sát kết quả", "cải thiện chất lượng"]
          }
        ]
      },
      {
        "title": "Các công cụ và kỹ thuật quản lý chất lượng",
        "content": "",
        "keywords": ["công cụ quản lý chất lượng", "kỹ thuật quản lý chất lượng"],
        "subheadings": [
          {
            "title": "Seven Basic Tools",
            "content": "",
            "keywords": ["Seven Basic Tools"],
            "subsubheadings": [
              {
                "title": "Biểu đồ nguyên nhân kết quả (xương cá)",
                "content": "Có dạng 5M1E với 6 yếu tố: nguyên nhiên vật liệu, con người, môi trường, máy móc thiết bị, phương pháp và đo lường. Áp dụng 5P với 5 yếu tố: Product, Price, People, Place và Process. Mục đích: xác định nguyên nhân, tìm hiểu lý do để giải quyết các khó khăn, nhu cầu nhận diện các lĩnh vực IT, tìm hiểu nguyên nhân không đưa ra đúng kết quả.",
                "keywords": ["biểu đồ xương cá", "5M1E", "5P"]
              },
              {
                "title": "Biểu đồ kiểm soát",
                "content": "Là đồ thị đường gấp khúc biểu diễn giá trị trung bình của đặc tính, tỷ lệ khuyết tật hoặc số khuyết tật. Dùng kiểm tra sự bất thường dựa trên những thay đổi của các đặc tính kiểm soát. Có 3 loại biểu đồ kiểm soát: Biểu đồ trung bình (X-bar chart), Biểu đồ độ rộng (R chart) và Biểu đồ độ lệch chuẩn (S chart). Mục đích: giám sát độ biến thiên, dự tính trung bình hoặc độ biến thiên (mức độ phân tán trong biểu đồ histogram), đánh giá những tác nhân làm ảnh hưởng đến nỗ lực cải tiến liên tục.",
                "keywords": ["biểu đồ kiểm soát", "X-bar chart", "R chart", "S chart"]
              },
              {
                "title": "Phiếu kiểm soát (checksheet)",
                "content": "Là một biểu mẫu đơn giản, trực quan, được dùng để thu thập dữ liệu. Được thiết kế và tuỳ chỉnh bởi người sử dụng sao cho phù hợp với mục đích thu thập. Là cơ sở để lưu hồ sơ và dữ liệu để phân tích thống kê. Mục đích: thu thập dữ liệu về số lượng hoặc tần suất xuất hiện các vấn đề liên quan; sử dụng như phiếu ghi chép giúp ghi nhận lại dữ liệu, phân loại các hạng mục khác nhau; kiểm tra, xác nhận công việc để phòng ngừa xảy ra sự cố hay sai sót.",
                "keywords": ["phiếu kiểm soát", "checksheet", "thu thập dữ liệu"]
              },
              {
                "title": "Biểu đồ phân tán (scatter diagram)",
                "content": "Là biểu đồ giúp xác định mối liên hệ giữa hai biến số. Hiển thị giá trị của hai biến được vẽ dọc theo hai trục của biểu đồ. Mô hình của các điểm kết quả sẽ tiết lộ mối tương quan giữa chúng. Mục đích: để xác nhận mối quan hệ giữa nguyên nhân và kết quả; hiểu nguyên nhân của hiệu suất kém.",
                "keywords": ["biểu đồ phân tán", "scatter diagram", "mối tương quan"]
              },
              {
                "title": "Biểu đồ tần suất (histogram)",
                "content": "Là 1 dạng biểu đồ thể hiện tần suất dạng cột. Biểu thị phân bố đặc tính chất lượng sản phẩm. Mục đích: dùng thống kê để phân bổ vùng dữ liệu từ đó đưa ra những kết luận phù hợp để cải tiến và nâng cao chất lượng; ngoài ra còn cho biết 4 vấn đề như giá trị thường xuyên xuất hiện nhiều nhất, mức độ xuất hiện của mỗi giá trị, hình dạng của phân bổ giá trị, mối quan hệ giữa các dữ liệu.",
                "keywords": ["biểu đồ tần suất", "histogram", "phân bố đặc tính"]
              },
              {
                "title": "Biểu đồ Pareto",
                "content": "Là biểu đồ hình cột với các số liệu được sắp xếp sẵn từ thấp đến cao. Các số liệu sẽ phản ảnh lại các dữ liệu được thu thập chính xác nhất giúp giải quyết vấn đề. Mục đích: hỗ trợ phân loại yếu tố và vấn đề cần giải quyết trước, giúp đánh giá và nâng cao hiệu suất công việc; tối ưu hoá quá trình gia tăng năng suất; quản trị rủi ro hiệu quả, đảm bảo đề xuất những giải pháp đúng đắn; xác định hướng phát triển bền vững.",
                "keywords": ["biểu đồ Pareto", "phân loại yếu tố", "quản trị rủi ro"]
              },
              {
                "title": "Biểu đồ flowchart",
                "content": "Là một biểu diễn dạng sơ đồ minh hoạ trình tự các hoạt động được thực hiện để có được kết quả mong muốn và nó còn được gọi là sơ đồ dòng chảy quy trình. Mục đích: theo dõi quy trình, nêu bật các bước quan trọng, mô tả cấu trúc quy trình, sơ đồ hoá dễ nắm bắt quy trình hệ thống.",
                "keywords": ["biểu đồ flowchart", "sơ đồ dòng chảy quy trình"]
              }
            ]
          },
          {
            "title": "Six sigma",
            "content": "Six Sigma (6 Sigma, hay 6σ) là một hệ phương pháp cải tiến quy trình kinh doanh và quản lý chất lượng bằng cách dựa trên thống kê để tìm ra lỗi (khuyết tật), xác định nguyên nhân của lỗi và xử lý lỗi nhằm làm tăng độ chính xác của quy trình do hãng Motorola phát triển đầu tiên năm 1985. Ý nghĩa: giảm tỉ lệ sai sót kĩ thuật, loại trừ các nguồn tạo nên dao động (bất ổn) trong quá trình kinh doanh, tập trung vào việc thông hiểu nhu cầu của khách hàng. Lợi ích của Six sigma: chi phí sản xuất giảm, chi phí quản lý giảm, thời gian chu trình giảm, sự hài lòng của khách hàng gia tăng, mở rộng sản xuất dễ dàng hơn.",
            "keywords": ["Six Sigma", "cải tiến quy trình", "quản lý chất lượng", "Motorola"]
          }
        ]
      }
    ]
    }
]
}