{
  "chapters": [
    {
      "title": "Tổng quan", 
      "headings": [
        {
          "title": "Khái niệm về quản lý",
          "content": "Quản lý (nói chung) là sự tác động của chủ thể quản lý lên đối tượng quản lý nhằm đạt được mục tiêu nhất định trong điều kiện trong điều kiện biến động của môi trường.",
          "keywords": ["quản lý", "chủ thể quản lý", "đối tượng quản lý", "mục tiêu", "môi trường quản lý"],
          "subheadings": [
            {
              "title": "Các yếu tố của quản lý",
              "content": "+ Có chủ thể quản lý (người quản lý)\n+ Có đối tượng quản lý (người bị quản lý)\n+ Có mục tiêu cần đạt được\n+ Có môi trường quản lý",
              "keywords": ["chủ thể quản lý", "đối tượng quản lý", "mục tiêu", "môi trường quản lý"]
            },
            {
              "title": "Các khái niệm khác về quản lý",
              "content": "• Quản lý là nghệ thuật đạt mục đích thông qua nỗ lực của những người khác (khái niệm định tính). \n• Quản lý là công tác phối hợp có hiệu quả các hoạt động của những cộng sự khác nhau trong cùng một tổ chức. \n• Quản lý là quá trình lập kế hoạch, tổ chức, chỉ huy, lãnh đạo và kiểm tra các nguồn lực cơ quan, nhằm đạt được mục đích với hiệu quả cao trong điều kiện môi trường luôn luôn biến động\n• Quản lý là một nghệ thuật với sự đa dạng, phong phú, muôn màu, muôn vẻ của sự vật hiện tượng. Quản lý sẽ khác nhau ở từng lĩnh vực khác nhau. Người quản lý phải khéo léo, linh hoạt. Hiệu quả quản lý phụ thuộc vào kinh nghiệm, cá tính, cơ may, vận rủi của người quản lý.\n• Quản lý là một môn khoa học đòi hỏi sự tổng hợp và vận hành các quy luật; kinh tế, công nghệ, xã hội. Quản lý vận dụng những thành tựu khoa học, công nghệ trong quản lý: các phương pháp dự báo, tâm lý học, tin học.\n• Quản lý là một nghề, phải học mới làm được. Muốn thực hành được, phải có nhiều yếu tố ban đâu: cách học, chương trình học, năng khiếu, nghề nghiệp",
              "keywords": ["nghệ thuật quản lý", "phối hợp hiệu quả", "lập kế hoạch", "tổ chức", "chỉ huy", "lãnh đạo", "kiểm tra", "nguồn lực", "mục tiêu", "môi trường biến động", "đa dạng", "phong phú", "người quản lý", "kinh nghiệm", "cá tính", "vận may", "vận rủi", "khoa học quản lý", "quy luật", "kinh tế", "công nghệ", "xã hội", "phương pháp dự báo", "tâm lý học", "tin học", "nghề quản lý", "học quản lý", "chương trình học", "năng khiếu", "nghề nghiệp"]
            }
          ]
        },
        {
          "title": "Sự cần thiết của quản lý dự án",
          "content": "",
          "keywords": ["quản lý dự án", "cần thiết"],
          "subheadings": [
            {
              "title": "Các thống kê về quản lý dự án",
              "content": "– Mỗi năm Nước Mỹ đã tiêu 2.3 nghìn tỷ USD cho các dự án – tương đương với 1/4 GDP \n– Cả thế giới đã tiêu 10 nghìn tỷ USD cho tất cả các loại dự án trong tổng số 40.7 nghìn tỷ GDP \n– Có hơn 1.6 triệu người quan tâm đến quản trị dự án trong công việc của họ, trung bình một người quản trị dự án kiếm được 82,000 USD mỗi năm.\n– Số lượng các dự án IT tăng rất nhanh: Năm 2000, có 300,000 dự án IT; Năm 2001, có 500,000 dự án IT \n– Rất nhiều nhà kinh doanh, các tác giả và những chuyên gia nổi tiếng nhấn mạnh đến tầm quan trọng về quản trị dự án. Tom Peters đã viết trong một quyển sách của ông, “To win today you must master the art of the project!”\nNăm 2003, Standish Group thống kê trên 13.522 dự án IT, thấy rõ sự tiến bộ \n– Tỉ lệ dự án thành công là 34% so với 16,2% trước đây \n– Thời gian quá hạn giảm đáng kể, từ 222% xuống còn 163% \n– Mức vượt ngân sách giảm từ 189% xuống còn 145% \n– Các tính năng theo yêu cầu đạt 67% so với 61% trước đây",
              "keywords": ["thống kê", "quản lý dự án", "Mỹ", "GDP", "dự án IT", "Tom Peters", "Standish Group"]
            },
            {
              "title": "Dự án thất bại",
              "content": "Khái niệm: Dự án thất bại là dự án không đạt được mục tiêu của dự án, không đáp ứng được thời hạn, vượt quá ngân sách ít nhất 10-20%. Một số lý do dẫn đến thất bại: Quản lý kém, thiếu thông tin trong quá trình thực hiện dự án, không rõ mục tiêu, các lý do khác.",
              "keywords": ["dự án thất bại", "mục tiêu", "thời hạn", "ngân sách", "lý do thất bại", "quản lý kém", "thiếu thông tin"]
            },
            {
              "title": "Ưu điểm của quản lý dự án",
              "content": "Kiểm soát tốt hơn các tài nguyên về tài chính, vật liệu và nguồn nhân lực; cải tiến quan hệ với khách hàng; rút ngắn thời gian phát triển; giảm chi phí, lợi nhuận cao hơn; chất lượng và độ tin cậy cao hơn; cải tiến năng suất lao động; phối hợp nội bộ tốt hơn; tinh thần làm việc cao hơn",
              "keywords": ["ưu điểm", "quản lý dự án", "kiểm soát tài nguyên", "quan hệ khách hàng", "thời gian phát triển", "chi phí", "lợi nhuận", "chất lượng", "độ tin cậy", "năng suất lao động", "phối hợp nội bộ", "tinh thần làm việc"]
            }
          ]
        },
        {
          "title": "Khái niệm dự án",
          "content": "",
          "keywords": ["dự án", "khái niệm dự án"],
          "subheadings": [
            {
              "title": "Khái niệm",
              "content": "Dự án là một chuỗi các công việc (nhiệm vụ, hoạt động), được thực hiện nhằm đạt được mục tiêu đề ra trong điều kiện ràng buộc về phạm vi, thời gian và ngân sách. \nDự án là một tập hợp nhiều hoạt động có mối quan hệ chặt chẽ với nhau, để hoàn thành một sản phẩm nhất định với chi phí và thời gian xác định.\nDự án là một nỗ lực tạm thời được tiến hành để tạo ra một sản phẩm hoặc dịch vụ duy nhất” (PMBOK® Guide 2000).",
              "keywords": ["chuỗi công việc", "nhiệm vụ", "hoạt động", "mục tiêu", "phạm vi", "thời gian", "ngân sách", "sản phẩm", "dịch vụ", "PMBOK® Guide"]
            },
            {
              "title": "4 yếu tố quan trọng",
              "content": "",
              "keywords": ["yếu tố quan trọng"],
              "subsubheadings": [
                {
                  "title": "Tập thể thực hiện dự án",
                  "content": "Nguồn nhân lực, mỗi người có chuyên môn và năng lực nhất định.",
                  "keywords": ["tập thể thực hiện dự án", "nguồn nhân lực", "chuyên môn", "năng lực"]
                },
                {
                  "title": "Thời gian dự kiến thực hiện dự án",
                  "content": "Ngày bắt đầu, ngày kết thúc, thời điểm trung gian ứng với kết quả trung gian.",
                  "keywords": ["thời gian thực hiện dự án", "ngày bắt đầu", "ngày kết thúc", "thời điểm trung gian"]
                },
                {
                  "title": "Kết quả dự kiến",
                  "content": "Sản phẩm sau cùng của dự án, phải hình dung và mô tả được. Kết quả có đặc tính/đặc điểm gì, giá trị sử dụng như thế nào? hiệu quả ra làm sao?",
                  "keywords": ["kết quả dự kiến", "sản phẩm cuối cùng", "đặc tính", "giá trị sử dụng", "hiệu quả"]
                },
                {
                  "title": "Kinh phí dự kiến",
                  "content": "Tiền để thực hiện dự án. Người (hoặc đơn vị) cấp tiền (cấp vốn) được gọi là chủ đầu tư.",
                  "keywords": ["kinh phí dự kiến", "tiền thực hiện dự án", "chủ đầu tư", "cấp vốn"]
                }
              ]
            },
            {
              "title": "Các thuộc tính của dự án",
              "content": "Có mục đích rõ ràng\nCó tính tạm thời: có ngày bắt đầu, ngày kết thúc\nCó ràng buộc về chi phí, thời gian, nguồn lực\nCần nhiều tài nguyên của nhiều lĩnh vực khác nhau: ví dụ phần cứng, phần mềm, công cụ, thiết bị hỗ trợ...\nCó nhiều rủi ro (không chắc chắn)\nNhiều người và tổ chức khác nhau cùng tham gia: có khách hàng và/hoặc nhà tài trợ",
              "keywords": ["thuộc tính dự án", "mục đích", "tạm thời", "chi phí", "thời gian", "nguồn lực", "tài nguyên", "rủi ro", "khách hàng", "nhà tài trợ"]
            },
            {
              "title": "Dự án công nghệ thông tin",
              "content": "Dự án công nghệ thông tin\nLà 1 dự án thực hiện trong lĩnh vực công nghệ thông tin (liên quan đến các vấn đề phần cứng, phần mềm và con người.)\nTuân thủ các nguyên tắc của một dự án nói chung\nTuân thủ các nguyên tắc công nghệ thông tin: đi theo qui trình sản xuất và chế tạo ra sản phẩm công nghệ thông tin",
              "keywords": ["dự án công nghệ thông tin", "phần cứng", "phần mềm", "con người", "nguyên tắc dự án", "quy trình sản xuất", "sản phẩm công nghệ thông tin"]
            }
          ]
        },
        {
          "title": "Phân loại dự án",
          "content": "",
          "keywords": ["phân loại dự án"],
          "subheadings": [
            {
              "title": "Theo tầm cỡ dự án",
              "content": "Dự án lớn: tổng kinh phí huy động lớn, số lượng các bên tham gia đông, thời gian dàn trải, qui mô rộng lớn.\nDự án trung bình và nhỏ: không đòi hỏi kinh phí nhiều, thời gian ấn định ngắn, không quá phức tạp.",
              "keywords": ["tầm cỡ dự án", "dự án lớn", "dự án trung bình", "dự án nhỏ", "kinh phí", "quy mô", "thời gian"]
            },
            {
              "title": "Theo nội dung dự án",
              "content": "Dự án ứng dụng CNTT trong công tác quản lý và hoạt động nghiệp vụ, trong đó trọng tâm là Tin học hóa phục vụ điều hành và quản lý Nhà nước;\nXây dựng hệ thống các Cơ sở dữ liệu (CSDL) quốc gia và chuyên ngành;\nPhát triển tiềm lực và cơ sở hạ tầng về CNTT.",
              "keywords": ["nội dung dự án", "ứng dụng CNTT", "quản lý", "hoạt động nghiệp vụ", "tin học hóa", "quản lý nhà nước", "CSDL quốc gia", "CSDL chuyên ngành", "tiềm lực", "cơ sở hạ tầng", "CNTT"]
            },
            {
              "title": "Các cách phân loại khác",
              "content": "Dự án nhiều người hay ít người tham gia;\nDự án nội bộ hay bên ngoài;\nDự án dài hạn hay ngắn hạn.",
              "keywords": ["phân loại khác", "nhiều người", "ít người", "dự án nội bộ", "dự án bên ngoài", "dự án dài hạn", "dự án ngắn hạn"]
            }
          ]
        },
        {
          "title": "Quản lý dự án là gì",
          "content": "",
          "keywords": ["quản lý dự án"],
          "subheadings": [
            {
              "title": "Khái niệm",
              "content": "QLDA là việc áp dụng kiến thức (knowledge), kỹ năng (skills), công cụ (tools) và kỹ thuật (techniques) vào hoạt động của một dự án nhằm đáp ứng các yêu cầu của dự án. (PMBOK Guide)",
              "keywords": ["khái niệm", "kiến thức", "kỹ năng", "công cụ", "kỹ thuật", "yêu cầu dự án", "PMBOK Guide"]
            },
            {
              "title": "Mục đích của quản lý dự án",
              "content": "Nhằm đảm bảo cho dự án được thực hiện thành công, nghĩa là phải đáp ứng các yêu cầu sau: Hoàn thành trong thời gian quy định, chi phí không vượt quá 10 – 20% kinh phí dự kiến, kết quả đáp ứng yêu cầu mục tiêu đề ra, khách hàng hài lòng, sử dụng nguồn lực hiệu quả",
              "keywords": ["mục đích quản lý dự án", "thành công", "thời gian", "chi phí", "kinh phí", "kết quả", "mục tiêu", "khách hàng hài lòng", "nguồn lực hiệu quả"]
            }
          ]
        },
        {
          "title": "Các giai đoạn của dự án Công nghệ Thông Tin",
          "content": "Có 7 giai đoạn: xác định, phân tích, thiết kế, thực hiện, kiểm thử hệ thống, kiểm thử chấp nhận, vận hành",
          "keywords": ["giai đoạn dự án", "CNTT"],
          "subheadings": [
            {
              "title": "Giai đoạn xác định",
              "content": "",
              "keywords": ["xác định"],
              "subsubheadings": [
                {
                  "title": "Mục tiêu",
                  "content": "Hiểu đầy đủ về các vấn đề của dự án, các yêu cầu của người dùng, Ước lượng được giá thành và thời gian thực hiện.",
                  "keywords": ["mục tiêu xác định"]
                },
                {
                  "title": "Các hoạt động chính",
                  "content": "Xác định vấn đề, mục tiêu, kết quả, viết đề cương dự án và nghiên cứu tính khả thi, xác định các rủi ro, lập kế hoạch ban đầu, đề xuất giải pháp với người dùng",
                  "keywords": ["hoạt động chính xác định"]
                },
                {
                  "title": "Tài liệu kết quả",
                  "content": "Đề cương dự án, nghiên cứu khả thi, danh sách rủi ro, kế hoạch ban đầu, giải pháp đề xuất",
                  "keywords": ["tài liệu kết quả xác định"]
                }
              ]
            },
            {
              "title": "Giai đoạn phân tích",
              "content": "",
              "keywords": ["phân tích"],
              "subsubheadings": [
                {
                  "title": "Mục tiêu",
                  "content": "Xác định các yêu cầu chức năng của hệ thống, hình dung hệ thống sẽ thực hiện các chức năng như thế nào",
                  "keywords": ["mục tiêu phân tích"]
                },
                {
                  "title": "Các hoạt động chính",
                  "content": "Viết tài liệu đặc tả chức năng, xem lại kế hoạch ban đầu, thiết kế hệ thống ở mức tổng thể",
                  "keywords": ["hoạt động chính phân tích"]
                },
                {
                  "title": "Tài liệu kết quả",
                  "content": "Đặc tả chức năng, kế hoạch triển khai",
                  "keywords": ["tài liệu kết quả phân tích"]
                }
              ]
            },
            {
              "title": "Giai đoạn thiết kế",
              "content": "",
              "keywords": ["thiết kế"],
              "subsubheadings": [
                {
                  "title": "Mục tiêu",
                  "content": "Xác định chính xác hệ thống sẽ làm việc như thế nào, xác định các bộ phận, các chức năng và các mối liên kết giữa chúng",
                  "keywords": ["mục tiêu thiết kế"]
                },
                {
                  "title": "Các hoạt động chính",
                  "content": "Viết tài liệu đặc tả thiết kế, soạn kế hoạch kiểm thử chấp nhận",
                  "keywords": ["hoạt động chính thiết kế"]
                },
                {
                  "title": "Tài liệu kết quả",
                  "content": "Đặc tả thiết kế, kế hoạch kiểm thử chấp nhận",
                  "keywords": ["tài liệu kết quả thiết kế"]
                }
              ]
            },
            {
              "title": "Giai đoạn thực hiện",
              "content": "",
              "keywords": ["thực hiện"],
              "subsubheadings": [
                {
                  "title": "Mục tiêu",
                  "content": "Xây dựng và ráp nối các thành phần của hệ thống",
                  "keywords": ["mục tiêu thực hiện"]
                },
                {
                  "title": "Các hoạt động chính",
                  "content": "Triển khai cài đặt theo thiết kế, kiểm thử từng thành phần, biên soạn tài liệu",
                  "keywords": ["hoạt động chính thực hiện"]
                },
                {
                  "title": "Tài liệu kết quả",
                  "content": "Biên bản kiểm thử từng thành phần, kế hoạch kiểm thử hệ thống, tài liệu cho người dùng",
                  "keywords": ["tài liệu kết quả thực hiện"]
                }
              ]
            },
            {
              "title": "Giai đoạn kiểm thử hệ thống",
              "content": "",
              "keywords": ["kiểm thử hệ thống"],
              "subsubheadings": [
                {
                  "title": "Mục tiêu",
                  "content": "Tích hợp tất cả phần cứng, kiểm tra các chức năng trong thiết kế, đảm bảo hệ thống làm việc tốt, không bị lỗi",
                  "keywords": ["mục tiêu kiểm thử hệ thống"]
                },
                {
                  "title": "Các hoạt động chính",
                  "content": "Tích hợp và kiểm thử từng phân hệ, tích hợp và kiểm thử toàn bộ hệ thống",
                  "keywords": ["hoạt động chính kiểm thử hệ thống"]
                },
                {
                  "title": "Tài liệu kết quả",
                  "content": "Biên bản kết quả kiểm thử hệ thống, sản phẩm sau khi kiểm thử là toàn bộ hệ thống đã làm việc tốt",
                  "keywords": ["tài liệu kết quả kiểm thử hệ thống"]
                }
              ]
            },
            {
              "title": "Giai đoạn kiểm thử chấp nhận",
              "content": "",
              "keywords": ["kiểm thử chấp nhận"],
              "subsubheadings": [
                {
                  "title": "Mục tiêu",
                  "content": "Đạt được sự chấp nhận của người dùng bằng văn bản",
                  "keywords": ["mục tiêu kiểm thử chấp nhận"]
                },
                {
                  "title": "Các hoạt động chính",
                  "content": "Thực hiện các kiểm thử đã đưa ra trong kế hoạch kiểm thử chấp nhận, demo cho khách hàng các chức năng của hệ thống, hiệu chỉnh nếu cần thiết",
                  "keywords": ["hoạt động chính kiểm thử chấp nhận"]
                },
                {
                  "title": "Tài liệu kết quả",
                  "content": "Báo cáo kết quả demo, biên bản xác nhận của người dùng",
                  "keywords": ["tài liệu kết quả kiểm thử chấp nhận"]
                }
              ]
            },
            {
              "title": "Giai đoạn vận hành",
              "content": "",
              "keywords": ["vận hành"],
              "subsubheadings": [
                {
                  "title": "Mục tiêu",
                  "content": "Chuyển giao toàn bộ hệ thống cho người dùng, vận hành và hoàn thiện hệ thống",
                  "keywords": ["mục tiêu vận hành"]
                },
                {
                  "title": "Các hoạt động chính",
                  "content": "Cài đặt hệ thống cho khách hàng, đào tạo người sử dụng, bảo hành, rút kinh nghiệm",
                  "keywords": ["hoạt động chính vận hành"]
                },
                {
                  "title": "Tài liệu kết quả",
                  "content": "Báo cáo kết quả vận hành, kinh nghiệm đút kết được",
                  "keywords": ["tài liệu kết quả vận hành"]
                }
              ]
            }
          ]
        }
  ]

    },
    {
      "title": "Cơ cấu quản lý dự án",
      "headings": [
        {
          "title": "Bộ ba ràng buộc của quản lý dự án",
          "content":"Các mục tiêu về phạm vi: Dự án phải đạt được cái gì. Các mục tiêu về thời gian: Dự án mất bao lâu để hoàn thành. Các mục tiêu về chi phí: Dự án cần bao nhiêu tiền. Nhiệm vụ của người quản lý dự án là phải cân đối những mục tiêu thường hay xung đột này",
          "keywords": ["phạm vi, thời gian, chi phí, nhiệm vụ người quản lý dự án"]
        },
        {
          "title": "Các lĩnh vực kiến thức trong quản lý dự án",
          "content": "",
          "keywords": ["lĩnh vực kiến thức", "quản lý dự án"],
          "subheadings": [
            {
              "title": "Chín lĩnh vực kiến thức cần phát triển",
              "content": "Mô tả các năng lực chủ yếu người quản lý dự án cần phát triển",
              "keywords": ["năng lực quản lý dự án"]
            },
            {
              "title": "Bốn lĩnh vực quản lý cơ bản",
              "content": "Gồm quản lý phạm vi, quản lý thời gian, quản lý chi phí, và quản lý chất lượng",
              "keywords": ["quản lý phạm vi", "quản lý thời gian", "quản lý chi phí", "quản lý chất lượng"],
              "subsubheadings": [
                {
                  "title": "Quản lý phạm vi",
                  "content": "Xác định phạm vi công việc và quản lý tất cả các công việc trong dự án: xác định cách tổ chức thực hiện một giai đoạn nào đó của dự án; xác định sản phẩm giao nộp; kiểm soát những thay đổi về phạm vi dự án",
                  "keywords": ["quản lý phạm vi dự án"]
                },
                {
                  "title": "Quản lý thời gian",
                  "content": "Ước lượng thời gian hoàn thành dự án và lập lịch biểu thích hợp: xác định thời gian hoàn thành công việc; xác định trình tự thực hiện và kiểm soát thay đổi lịch trình",
                  "keywords": ["quản lý thời gian dự án"]
                },
                {
                  "title": "Quản lý chi phí",
                  "content": "Đảm bảo hoàn thành công việc trong kinh phí cho phép: xây dựng kế hoạch huy động tài nguyên thực hiện dự án; ước tính chi phí cho từng loại tài nguyên và hạng mục công việc; kiểm soát những thay đổi về chi phí",
                  "keywords": ["quản lý chi phí dự án"]
                },
                {
                  "title": "Quản lý chất lượng",
                  "content": "Đảm bảo chất lượng các sản phẩm giao nộp đáp ứng yêu cầu đề ra: xác định chuẩn mực chất lượng; bảo đảm chất lượng sản phẩm; quản lý thay đổi chất lượng",
                  "keywords": ["quản lý chất lượng dự án"]
                }
              ]
            },
            {
              "title": "Bốn lĩnh vực hỗ trợ",
              "content": "Phương tiện để đạt được mục tiêu của dự án, bao gồm quản lý nguồn nhân lực, quản lý truyền thông, quản lý rủi ro, và quản lý mua sắm",
              "keywords": ["quản lý nguồn nhân lực", "quản lý truyền thông", "quản lý rủi ro", "quản lý mua sắm"],
              "subsubheadings": [
                {
                  "title": "Quản lý nguồn nhân lực",
                  "content": "Sử dụng lực lượng tham gia dự án một cách hiệu quả: xác định vị trí, vai trò, trách nhiệm và quan hệ báo cáo; lựa chọn và phát triển nguồn nhân lực",
                  "keywords": ["quản lý nguồn nhân lực dự án"]
                },
                {
                  "title": "Quản lý truyền thông",
                  "content": "Đảm bảo thông tin được tạo ra, thu thập, lưu trữ và trao đổi kịp thời và chính xác: xác định nhu cầu thông tin, cách thức và phương tiện trao đổi; xây dựng cơ chế báo cáo",
                  "keywords": ["quản lý truyền thông dự án"]
                },
                {
                  "title": "Quản lý rủi ro",
                  "content": "Xác định, phân tích và ứng phó với các rủi ro của dự án: nhận diện và ước tính rủi ro; kiểm soát phòng chống rủi ro",
                  "keywords": ["quản lý rủi ro dự án"]
                },
                {
                  "title": "Quản lý mua sắm",
                  "content": "Đảm bảo có được hàng hoá và dịch vụ chất lượng: lập kế hoạch mua sắm; thực hiện kế hoạch mua sắm; lựa chọn nhà cung cấp và quản lý hợp đồng",
                  "keywords": ["quản lý mua sắm dự án"]
                }
              ]
            },
            {
              "title": "Lĩnh vực tích hợp (project integration management)",
              "content": "Đảm bảo các thành phần khác nhau trong dự án được phối hợp hài hòa; xây dựng và hoàn thiện kế hoạch dự án; kiểm soát các thay đổi tổng thể",
              "keywords": ["tích hợp dự án", "project integration management"]
            }
          ]
        },
        {
          "title": "Các công cụ và kỹ thuật",
          "content": "",
          "keywords": ["công cụ quản lý dự án", "kỹ thuật quản lý dự án"],
          "subheadings": [
            {
              "title": "Quản lý phạm vị",
              "content": "Scope statement, WBS (Work Breakdown Structure) ",
              "keywords": ["scope statement","WBS", "Work Breakdown Structure"]
            },
            {
              "title": "Quản lý thời gian",
              "content": "Biểu đồ Gantt, biểu đồ mạng, MS Project, Planer, Open Plan, ...",
              "keywords": ["Quản lý thời gian", "Gantt chart", "biểu đồ mạng", "MS Project", "Planer", "Open Plan"]
            },
            {
              "title": "Quản lý chi phí",
              "content": "Ước lượng chi phí, MS Project, Planer, Gantt chart, Costar, ...",
              "keywords": ["Quản lý chi phí", "ước lượng chi phí", "MS Project", "Planer", "Gantt chart", "Costar"]
            }
          ]
        },
        {
          "title": "Các kỹ năng cần thiết",
          "content": "Kỹ năng giao tiếp, kỹ năng tổ chức, kỹ năng xây dựng nhóm, kỹ năng lãnh đạo, kỹ năng giải quyết vấn đề, kỹ năng công nghệ, ...",
          "keywords": ["kỹ năng giao tiếp", "kỹ năng tổ chức", "kỹ năng xây dựng nhóm", "kỹ năng lãnh đạo", "kỹ năng giải quyết vấn đề", "kỹ năng công nghệ"]
        }
      ]
    },
    {
      "title": "Quy trình quản lý dự án",
      "headings": [
        {
          "title": "Quy trình khởi động",
          "content": "Nhận diện và bắt đầu một dự án mới. Các kết quả chính gồm: Chọn người quản trị dự án, Xác định các stakeholders chính, Hoàn tất các nghiệp vụ (business case), Hoàn tất tuyên bố về dự án và lấy chữ ký.",
          "keywords": ["quy trình khởi động", "business case", "stakeholders"]
        },
        {
          "title": "Quy trình lập kế hoạch",
          "content": "Xác định các công việc và ước lượng tài nguyên, Sắp xếp thứ tự thực hiện các công việc, Chọn quy trình làm phần mềm, Dự đoán các rủi ro, biến cố trong tương lai và đưa ra giải pháp. Kết quả: Hợp đồng nhóm (team contract), Phát biểu về phạm vi dự án (scope statement), Biểu đồ phân rã công việc (WBS), Lịch biểu của dự án, dưới dạng biểu đồ Gantt với các tài nguyên sử dụng và các mối quan hệ phụ thuộc, Danh sách các rủi ro.",
          "keywords": ["quy trình lập kế hoạch", "WBS", "biểu đồ Gantt"]
        },
        {
          "title": "Quy trình thực thi",
          "content": "Thường chiếm nhiều thời gian và tài nguyên nhất để thực thi dự án vì sản phẩm của dự án được tạo ra trong giai đoạn này. Kết quả quan trọng nhất là kết quả công việc. Người quản trị dự án phải dùng kỹ năng lãnh đạo để vượt qua những thách thức xảy ra trong quá trình thực thi dự án.",
          "keywords": ["quy trình thực thi", "kết quả công việc"]
        },
        {
          "title": "Quy trình điều khiển",
          "content": "Điều khiển bao gồm đo tiến độ đạt được các mục tiêu của dự án, theo dõi độ lệch so với kế hoạch, và thực hiện các hoạt động chỉnh sửa cho phù hợp. Điều khiển tác động đến tất cả các nhóm quy trình khác và xảy ra trong tất cả các giai đoạn của chu trình sống dự án. Kết quả quan trọng của giai đoạn này là báo cáo tình trạng và báo cáo tiến độ.",
          "keywords": ["quy trình điều khiển", "báo cáo tiến độ"]
        },
        {
          "title": "Quy trình kết thúc",
          "content": "Quy trình kết thúc gồm đạt được sự chấp nhận của các stakeholder và khách hàng về sản phẩm và chuyển dự án sang trạng thái kết thúc. Cài đặt các kết quả của dự án, Huấn luyện sử dụng, Hoàn tất tài liệu, Chuẩn bị bảo hành, bảo trì, Thông báo kết thúc dự án. Ngay cả khi dự án chưa hoàn tất, nó cần phải kết thúc để rút kinh nghiệm, Tài liệu lưu trữ về dự án và các bài học kinh nghiệm là những kết quả quan trọng. Hầu hết các dự án có báo cáo và trình bày cuối cùng (final report and presentation).",
          "keywords": ["quy trình kết thúc", "bảo hành", "final report"]
        }
      ]
    },
    {
      "title": "Quản lý phạm vi",
      "headings": [
        {
          "title": "Quản lý phạm vi là gì",
          "content": "Phạm vi (Scope) đề cập đến tất cả những công việc liên quan đến việc tạo ra sản phẩm của dự án và các qui trình được sử dụng để tạo ra sản phẩm. Nó xác định điều gì cần làm và điều gì không làm. Các sản phẩm trung gian (Deliverables) là những sản phẩm được tạo ra như là một phần của dự án, như phần cứng, phần mềm, tài liệu đào tạo, chuyển giao, bảo hành… Nhóm dự án và các bên liên quan (Stakeholders) phải cùng hiểu những sản phẩm nào được tạo ra như là kết quả của dự án và chúng được tạo ra như thế nào.",
          "keywords": ["phạm vi", "sản phẩm trung gian", "nhóm dự án", "stakeholders"]
        },
        {
          "title": "Khởi động (Initiation)",
          "content":"", 
          "keywords": ["Khởi động"],
          "subheadings": [
            {
              "title": "Quy trình chọn dự án",
              "content": "Dựa vào kế hoạch chiến lược tổng thể của tổ chức. Phân tích vùng nghiệp vụ. Xác định dự án tiềm năng. Chọn các dự án CNTT và phân bổ tài nguyên. Kế hoạch chiến lược: nhìn vào bức tranh tổng thể hay kế hoạch chiến lược của một tổ chức, để phát triển một kế hoạch chiến lược về CNTT, là một trong những thông tin đầu vào, là một tiêu chí để chọn lựa dự án, đòi hỏi xác định các mục tiêu nghiệp vụ lâu dài, các dự án CNTT cần hỗ trợ các mục tiêu chiến lược, thương mại, tài chính của đơn vị.",
              "keywords": ["quy trình chọn dự án", "kế hoạch chiến lược", "phân tích vùng nghiệp vụ"]
            },
            {
              "title": "Phương pháp chọn lựa dự án",
              "content": "Hướng đến nhu cầu chung của công ty, tổ chức: nhu cầu, ngân sách, ý chí; phân loại dự án: vấn đề, yêu cầu, cơ hội, định hướng; phân tích tài chính: NPV Analysis, ROI (Return On Investment), Payback Analysis, thực hiện thẻ điểm cân đối (balanced scorecard). Mô hình trọng số (Weighted Scoring Model - WSM): Công cụ để chọn dự án dựa trên nhiều điều kiện: Xác định các điều kiện quan trọng cho thành công của dự án, gán các trọng số (phần trăm) cho mỗi điều kiện sao cho tổng của chúng bằng 100, gán các điểm cho mỗi điều kiện đối với mỗi dự án, nhân các điểm với trọng số và tính tổng các giá trị này - điểm càng cao càng tốt. Cách phân loại khác: thời gian thực hiện bao lâu và khi nào cần thiết, độ ưu tiên tổng thể của dự án.",
              "keywords": ["phương pháp chọn lựa dự án", "NPV Analysis", "ROI", "Payback Analysis", "balanced scorecard", "Weighted Scoring Model"]
            },
            {
              "title": "Project Charter (tuyên bố dự án)",
              "content": "Sau khi quyết định chọn dự án, cần đưa ra Tuyên bố dự án. Tuyên bố dự án (project charter) là tài liệu chính thức xác nhận sự tồn tại của dự án và đưa ra định hướng để thực hiện các mục tiêu của dự án và quản lý dự án. Các stakeholders chính của dự án cần ký vào tuyên bố dự án để xác nhận sự đồng tình với nhu cầu và mục đích của dự án.",
              "keywords": ["Project Charter", "tuyên bố dự án", "stakeholders"]
            }
          ]
        },
        {
          "title": "Lập kế hoạch phạm vi (Scope Planning)",
          "content": "Lập kế hoạch phạm vi là quá trình xây dựng các tài liệu nhằm cung cấp nền tảng cho các quyết định về dự án trong tương lai. Phát biểu về phạm vi (scope statement) gồm: lý giải về dự án (project justification), mô tả ngắn về sản phẩm của dự án, tổng kết về tất cả các sản phẩm trung gian của dự án, những yếu tố xác định thành công của dự án.",
          "keywords": ["lập kế hoạch phạm vi", "scope statement", "project justification", "sản phẩm trung gian"]
        },
        {
          "title": "Xác định phạm vi (Scope Definition)",
          "content": "Sau khi hoàn tất kế hoạch về phạm vi, bước tiếp theo là xác định chi tiết công việc bằng cách chia thành các công việc nhỏ hơn có thể quản lý được. Xác định đúng phạm vi: giúp cải tiến sự chính xác về thời gian, chi phí, và tài nguyên, xác định nền tảng để đo hiệu suất vận hành và điều khiển dự án, giúp truyền đạt rõ ràng các trách nhiệm của mỗi công việc.",
          "keywords": ["xác định phạm vi", "cải tiến", "thời gian", "chi phí", "tài nguyên", "hiệu suất vận hành"]
        },
        {
          "title": "Cấu trúc phân rã công việc (WBS – Work Break-down Structure)",
          "content":"", 
          "keywords": ["cấu trúc phân rã công việc", "WBS"],
          "subheadings": [
            {
              "title": "Khái niệm",
              "content": "Cấu trúc phân rã công việc (WBS- Work Break-down Structure) là cây phân cấp các nhóm công việc cần thực hiện trong dự án, nó xác định phạm vi tổng thể của dự án. Đây là tài liệu nền tảng trong quản lý dự án vì nó cung cấp cơ sở để lập kế hoạch và quản lý các lịch biểu, chi phí, và những biến đổi dự án.",
              "keywords": ["WBS", "cấu trúc phân rã công việc", "lập kế hoạch", "quản lý lịch biểu", "quản lý chi phí", "biến đổi dự án"]
            },
            {
              "title": "Ai xây dựng WBS",
              "content": "Người quản lý dự án; Khách hàng; thành viên tổ dự án; Người tài trợ dự án; Ban quản lý dự án.",
              "keywords": ["xây dựng WBS", "người quản lý dự án", "khách hàng", "thành viên tổ dự án", "người tài trợ dự án", "ban quản lý dự án"]
            },
            {
              "title": "Các hướng tiếp cận",
              "content": "WBS có 4 hướng tiếp cận: tiếp cận tương tự (xem lại WBS của các dự án tương tự, sửa đổi cho phù hợp với dự án hiện hành), tiếp cận từ trên xuống top-down (bắt đầu với thành phần lớn nhất, sau đó chia nhỏ dần), tiếp cận từ dưới lên bottom-up (bắt đầu từ công việc chi tiết, kế hợp thành công việc lớn), mind-mapping (chia thành các task chính phụ, phân bố theo sơ đồ).",
              "keywords": ["các hướng tiếp cận", "tiếp cận tương tự", "top-down", "bottom-up", "mind-mapping"]
            },
            {
              "title": "Những yếu tố trong bảng công việc",
              "content": "Những yếu tố trong bảng công việc gồm danh sách các sản phẩm: liệt kê theo dạng phân cấp, sản phẩm chính/phụ, ước lượng thời gian: theo từng công việc, lịch trình thực hiện: thứ tự thực hiện công việc, ngày bắt đầu, ngày kết thúc từng công việc, phân bố lực lượng, tài nguyên, tính chi phí, kiểm soát rủi ro.",
              "keywords": ["yếu tố bảng công việc", "danh sách sản phẩm", "sản phẩm chính", "sản phẩm phụ", "ước lượng thời gian", "lịch trình thực hiện", "phân bố lực lượng", "tài nguyên", "tính chi phí", "kiểm soát rủi ro"]
            },
            {
              "title": "Những điểm cần lưu ý",
              "content": "Từng công việc trong WBS được chi tiết tới mức thấp nhất (<80 giờ), đạt được sự đồng thuận giữa các bên, chuẩn bị bản thảo của WBS, gửi cho mọi người đọc trước, họp thảo luận, đi đến nhất trí và ký, thường xuyên cập nhật và kiểm soát các phiên bản của WBS.",
              "keywords": ["điểm cần lưu ý", "WBS", "sự đồng thuận", "chuẩn bị bản thảo", "cập nhật", "kiểm soát phiên bản"]
            },
            {
              "title": "Các nguyên lý cơ bản",
              "content": "Một đơn vị công việc chỉ xuất hiện một nơi trong WBS. Nội dung công việc trong một mục WBS bằng tổng các công việc dưới nó. Một mục WBS là nhiệm vụ đơn. WBS phải nhất quán với cách thực hiện công việc; trước hết nó phải phục vụ nhóm dự án và các mục đích khác nếu thực tế cho phép. Các thành viên nhóm dự án phải tham gia phát triển WBS để bảo đảm tính nhất quán. Mỗi mục WBS phải có tài liệu đi kèm để bảo đảm hiểu được chính xác phạm vi công việc. WBS phải là công cụ linh hoạt để đáp ứng những thay đổi không tránh được, điều khiển nội dung công việc theo đúng tuyên bố về phạm vi.",
              "keywords": ["nguyên lý cơ bản", "WBS", "nội dung công việc", "nhóm dự án", "tài liệu đi kèm", "tính nhất quán", "công cụ linh hoạt", "điều khiển nội dung công việc"]
            },
            {
              "title": "Tiêu chí để kiểm tra tính đầy đủ của WBS",
              "content": "Tiêu chí để kiểm tra tính đầy đủ của WBS là: tình trạng/tính toán của tất cả công việc (CV) có thể đo được, thời gian; tài nguyên và chi phí dễ ước lượng; thời gian hoàn thành CV trong giới hạn cho phép; công việc được phân công độc lập. Nếu một tiêu chí không thỏa thì PHÂN RÃ TIẾP.",
              "keywords": ["tiêu chí kiểm tra", "tính đầy đủ", "WBS", "công việc đo được", "thời gian", "tài nguyên", "chi phí", "phân công độc lập"]
            }
          ]
        },
        {
          "title": "Kiểm tra và điều khiển thay đổi phạm vi (Verification & Controling)",
          "content": "Kiểm tra phạm vi dự án và giảm thiểu thay đổi phạm vi là điều rất khó. Nhiều dự án CNTT phải tuyên bố phá sản vì chịu phải tình trạng vượt quá phạm vi (scope creep).",
          "keywords": ["kiểm tra phạm vi", "điều khiển thay đổi phạm vi", "giảm thiểu thay đổi phạm vi", "scope creep"]
        }
      ]
    },
    {
      "title": "Quản lý thời gian",
      "headings": [
        {
          "title": "Giới thiệu",
          "content": "Kết thúc dự án đúng hạn là một trong những thách thức lớn nhất, thời gian quá hạn trung bình là 222% (theo báo cáo của CHAOS năm 1995; được cải tiến lên 163% vào năm 2001. Thời gian có độ linh hoạt bé nhất; nó trôi qua bất kể điều gì xảy ra. Vấn đề lịch biểu là lý do chính dẫn đến xung đột trong dự án, đặc biệt là trong nửa sau của dự án.",
          "keywords": ["dự án", "thời gian", "xung đột", "lịch biểu"]
        },
        {
          "title": "Các quy trình quản lý thời gian dự án",
          "content":"",
          "keywords":["quy trình quản lý thời gian"],
          "subheadings": [
            {
              "title": "Xác định các hoạt động",
              "content": "Làm nền tảng cho phát triển các lịch biểu. Lịch biểu dự án bắt nguồn từ tài liệu khởi động dự án: bản tuyên bố dự án có chứa ngày bắt đầu và kết thúc, cùng với thông tin về ngân sách; tuyên bố phạm vi (scope statement) và WBS giúp xác định cần phải làm những gì. Xác định hoạt động đòi hỏi phát triển WBS chi tiết hơn cùng với những lời giải thích để hiểu được tất cả những việc cần làm, nhằm có được các ước lượng phù hợp với thực tế.",
              "keywords": ["xác định hoạt động", "lịch biểu", "tuyên bố dự án", "scope statement", "WBS"]
            },
            {
              "title": "Sắp xếp thứ tự các hoạt động",
              "content": "Xem xét các hoạt động và xác định quan hệ phụ thuộc: Phụ thuộc bắt buộc: cố hữu do bản chất công việc, logic cứng; Phụ thuộc xác định bởi nhóm dự án: logic mềm; Phụ thuộc ngoại: quan hệ giữa các hoạt động bên trong dự án và bên ngoài dự án. Phải xác định các quan hệ phụ thuộc mới dùng được phương pháp phân tích đường dẫn tới hạn. Sắp xếp theo kỹ thuật biểu đồ mạng (network diagram): Biểu đồ mạng là kỹ thuật được ưu tiên cho thấy thứ tự các hoạt động, biểu đồ mạng hiển thị quan hệ logic giữa các hoạt động của dự án, hoặc thứ tự các hoạt động của dự án. Các ràng buộc: No earlier than công việc xảy ra sau ngày cụ thể nhưng không sớm hơn ngày được cho. No later than: hướng đến deadline. Công việc phải được hoàn tất vào ngày đó hay ngày khác. On this date Không thể điều chỉnh, công việc phải được hoàn tất không sớm cũng không trễ. Ràng buộc quản lý: liên quan đến quyết định của PM, ràng buộc kỹ thuật, ràng buộc thực thi, ràng buộc tài nguyên (resource), ràng buộc tổ chức.",
              "keywords": ["sắp xếp thứ tự", "quan hệ phụ thuộc", "biểu đồ mạng", "network diagram", "ràng buộc"]
            },
            {
              "title": "Ước lượng thời gian cho mỗi hoạt động",
              "content": "Thời gian cho mỗi hoạt động là lượng thời gian thực hiện hoạt động này cộng với thời gian trôi qua. Nỗ lực là số ngày làm việc hoặc số giờ làm việc cần thiết để hoàn tất một hoạt động. Nỗ lực khác với thời gian. Những người thực hiện công việc sẽ giúp tạo ra các ước lượng, và các chuyên gia sẽ xem lại.",
              "keywords": ["ước lượng thời gian", "nỗ lực", "ngày làm việc", "giờ làm việc"]
            },
            {
              "title": "Phát triển lịch biểu",
              "content": "Phát triển lịch biểu dùng kết quả của các quy trình quản lý thời gian khác để xác định ngày bắt đầu và kết thúc của dự án, cùng với các hoạt động của nó. Mục đích cuối cùng là tạo được lịch biểu phù hợp thực tế, làm nền tảng theo dõi tiến độ thực hiện dự án. Các công cụ và kỹ thuật gồm biểu đồ Gantt, phân tích PERT, phân tích đường dẫn tới hạn,…",
              "keywords": ["phát triển lịch biểu", "ngày bắt đầu", "ngày kết thúc", "biểu đồ Gantt", "phân tích PERT", "đường dẫn tới hạn"]
            },
            {
              "title": "Kiểm soát lịch biểu",
              "content": "Kiểm tra lịch biểu so với thực tế, sử dụng kế hoạch phòng hờ bất trắc, không lập kế hoạch cho mọi người làm việc 100% khả năng vào mọi thời điểm, tổ chức các buổi họp tiến độ với các stakeholders và hãy rõ ràng và chân thật khi bàn về các vấn đề liên quan đến lịch biểu.",
              "keywords": ["kiểm soát lịch biểu", "kế hoạch phòng hờ", "họp tiến độ", "stakeholders"]
            }
          ]
        },
        {
          "title": "Các công cụ và kỹ thuật ước lượng thời gian",
          "content":"",
          "keywords":["công cụ kỹ thuật ước lượng"],
          "subheadings": [
            {
              "title": "Sử dụng ý kiến chuyên gia",
              "content": "Ưu điểm: Nhanh, dễ dùng, nếu đội ngũ chuyên gia có kinh nghiệm thì có thể ước lượng rất chính xác. Khuyết điểm: Kết quả thiếu tin cậy vì dựa trên kinh nghiệm chủ quan, cảm tính, rất khó tìm được chuyên gia.",
              "keywords": ["ý kiến chuyên gia", "ưu điểm", "khuyết điểm"]
            },
            {
              "title": "Ước lượng dựa vào lịch sử",
              "content": "Lưu giữ quy trình lịch sử của các dự án trước đó (cần bao lâu để hoàn thành, ai chịu trách nhiệm). So sánh công việc cần đánh giá với những công việc tương tự trong quá khứ. Ưu điểm: khá chính xác. Khuyết điểm: bất lợi khi các dự án đã thực hiện và dự án đang xem xét ước lượng không có điểm chung.",
              "keywords": ["ước lượng dựa vào lịch sử", "ưu điểm", "khuyết điểm"]
            },
            {
              "title": "Kỹ thuật PERT",
              "content": "Ưu điểm: Cần xét đến nhiều yếu tố tác động, khuyến khích trao đổi giữa các thành viên, kết quả đạt được là sự cân bằng giữa 2 thái cực, việc lập kế hoạch chi tiết hơn. Khuyết điểm: Tốn nhiều thời gian, có nguy cơ làm mọi người chán nản, đòi hỏi khối lượng tính toán lớn.",
              "keywords": ["kỹ thuật PERT", "ưu điểm", "khuyết điểm"]
            },
            {
              "title": "Phương pháp đường găng CPM",
              "content":"",
              "keywords":["đường găng CPM"],
              "subsubheadings": [
                {
                  "title": "Sơ đồ mạng",
                  "content": "AOA (Activity On Arc): tập đỉnh (nút) của đồ thị: mỗi đỉnh biểu diễn sự kiện (bắt đầu hay kết thúc dự án); tập cung: mỗi cung biểu diễn một công việc trong dự án. AON (Activity On Node): tập Đỉnh (nút) của đồ thị: mỗi đỉnh biểu diễn công việc; tập cung: mỗi cung biểu diễn quan hệ giữa các công việc.",
                  "keywords": ["sơ đồ mạng", "AOA", "AON"]
                },
                {
                  "title": "Đường găng",
                  "content": "Công việc găng: là những công việc nằm trên đường găng, ảnh hưởng trực tiếp đến thời gian hoàn thành dự án. Nếu muốn thay đổi kế hoạch thi công dự án (giảm chi phí, rút ngắn thời gian,…): trước tiên phải căn cứ vào các công việc găng. Một dự án có thể có nhiều đường găng, đường găng là không bất biến, các công việc ngoài đường găng được phép kéo dài hơn dự kiến (một thời gian nhất định) mà không ảnh hưởng tới chiều dài dự án. Các đường ngoài găng cũng có nguy cơ trở thành găng.",
                  "keywords": ["đường găng", "công việc găng", "thời gian hoàn thành dự án"]
                },
                {
                  "title": "Độ thả nổi",
                  "content": "Khoảng dư toàn phần (thả nổi toàn phần): là thời gian tối đa công việc có thể kéo dài mà không ảnh hưởng đến thời gian hoàn tất dự án. Khoảng dư tự do (thả nổi tự do): thời gian tối đa công việc có thể kéo dài mà không ảnh hưởng đến thời gian bắt đầu của các công việc sau nó.",
                  "keywords": ["độ thả nổi", "thả nổi toàn phần", "thả nổi tự do"]
                }
              ]
            },
            {
              "title": "Sơ đồ Gantt",
              "content": "Sơ đồ Gantt, tác giả là Henry Gantt, là hình thức khác của sơ đồ PERT và được dùng để kiểm soát tiến độ thực hiện, là bảng gồm nhiều cột đánh dấu mốc thời gian. Các ô trên dòng thứ i có thể được đánh dấu hoặc tô đen để biết công việc i sẽ thực hiện từ… đến…",
              "keywords": ["sơ đồ Gantt", "Henry Gantt", "kiểm soát tiến độ"]
            }
          ]
        },
        {
          "title": "Các kỹ thuật rút ngắn lịch biểu",
          "content": "Bố trí các công việc song song thay vì nối tiếp trong sơ đồ mạng, phân phối lại nguồn lực: tăng công nhân, tăng giờ lao động, tăng công suất thiết bị, thay đổi biện pháp kỹ thuật, biện pháp rút ngắn thời gian đường găng → chi phí dự án tăng. Nguyên tắc rút ngắn thời gian thực hiện với chi phí bỏ ra ít nhất: B1: Chọn công việc găng với chi phí để rút ngắn 1 đơn vị thời gian là ít nhất và giảm thời gian thực hiện công việc này đến mức tối đa, tức là tới khi đạt thời gian tối thiểu cần thiết để thực hiện công việc, xuất hiện đường găng mới. B2: Tính lại ti và Ti. Quay lại bước 1. B3: Nếu công việc găng cần rút ngắn nằm trên chu trình gồm nhiều công việc găng khác thì rút ngắn 2 công việc trên 2 nhánh khác nhau của chu trình sao cho tổng chi phí bỏ thêm của chúng là ít nhất (so với các công việc găng còn lại và các cặp công việc găng trên các nhánh của chu trình).",
          "keywords": ["rút ngắn lịch biểu", "bố trí công việc song song", "phân phối nguồn lực", "biện pháp kỹ thuật", "đường găng"]
        },
        {
          "title": "Kết luận",
          "content": "Ước lượng là khả năng yếu nhất của chúng ta, tất cả mọi kế hoạch và kiểm soát đều phụ thuộc vào kĩ năng ước lượng. Ước lượng là một quá trình lặp - nó cần phải được hiệu chỉnh dần. Ước lượng vẫn còn là một nghệ thuật. Không tồn tại phần mềm hay công cụ nào có sẵn để giúp chúng ta làm việc này. Kinh nghiệm, thống kê cũng rất có ích khi ước lượng. Điều mấu chốt cho việc ước lượng là chia nhỏ. Nếu công việc được chia thành những phần nhỏ hơn và bạn tính toán ước lượng cho từng phần việc nhỏ, một số phần sẽ có thể được ước lượng thừa, một số phần khác bị ước lượng thiếu. Cuối cùng bạn phải lấy trung bình - và đó cũng là điểm duy nhất có vấn đề.",
          "keywords": ["ước lượng", "kế hoạch", "kiểm soát", "chia nhỏ công việc"]
        }
      ]
    },
    {
      "title": "Quản lý chi phí",
      "headings": [
        {
          "title": "Giới thiệu",
          "content": "Những dự án về CNTT có hồ sơ theo dõi kém hiệu quả cho việc đạt được mục đích về giá cả, chi phí trung bình vượt quá dự toán ban đầu (overrun) theo nghiên cứu từ năm 1995 của CHAOS là 189%; đã được cải thiện 43% trong nghiên cứu năm 2010, ở Mỹ các dự án CNTT bị hủy làm tốn trên 81 tỉ đô la năm 1995.",
          "keywords": ["dự án CNTT", "chi phí", "dự toán ban đầu", "overrun", "CHAOS", "nghiên cứu", "Mỹ", "1995"]
        },
        {
          "title": "Khái niệm về quản lý chi phí",
          "content": "Chi phí là tài nguyên được hy sinh hay được tính trước để đạt được một mục tiêu rõ ràng hay để trao đổi cái gì đó: Chi phí thường được đo bằng đơn vị tiền tệ, chi phí dùng để trả cho yêu cầu về hàng hóa và dịch vụ, chi phí của dự án được chi cho việc cung cấp tài nguyên và được sử dụng bất kì nơi đâu trong dự án → Người quản lí dự án phải hiểu rõ việc quản lí chi phí dự án. Phân loại chi phí: trả công lao động, huấn luyện đào tạo lại, máy móc trang thiết bị, đi lại trao đổi, tiện nghi làm việc, văn phòng phẩm, thời gian, thu thập thông tin. Quản lý chi phí dự án bao gồm những quy trình yêu cầu đảm bảo cho dự án được hoàn tất trong ngân sách cho phép.",
          "keywords": ["chi phí", "tài nguyên", "mục tiêu", "đơn vị tiền tệ", "hàng hóa", "dịch vụ", "quản lí chi phí dự án"]
        },
        {
          "title": "Quy trình quản lý chi phí",
          "content":"",
          "keywords":["Quy trình quản lý chi phí"],
          "subheadings": [
            {
              "title": "Lập kế hoạch quản lý chi phí",
              "content": "Quyết định chính sách, qui trình, tài liệu được sử dụng cho việc thực thi và điều khiển chi phí.",
              "keywords": ["lập kế hoạch", "quản lý chi phí", "chính sách", "qui trình", "tài liệu"]
            },
            {
              "title": "Ước lượng chi phí",
              "content": "Ước lượng gần đúng cho những tài nguyên cần thiết để hoàn thành dự án.",
              "keywords": ["ước lượng chi phí", "tài nguyên", "hoàn thành dự án"]
            },
            {
              "title": "Dự toán ngân sách",
              "content": "Phân bổ chi phí ước tính vào từng hạng mục công việc để thiết lập một baseline cho việc kiểm soát.",
              "keywords": ["dự toán ngân sách", "phân bổ chi phí", "baseline", "kiểm soát"]
            },
            {
              "title": "Kiểm soát – điều chỉnh",
              "content": "Điều chỉnh ngay khi có sự thay đổi trong công việc, có liên quan đến ngân sách.",
              "keywords": ["kiểm soát", "điều chỉnh", "ngân sách"]
            }
          ]
        },
        {
          "title": "Lập kế hoạch quản lý chi phí",
          "content": "Xác định đơn vị sử dụng đo lường (ví dụ: theo ngày/giờ, …), xác định ngưỡng biến động chi phí cho phép, xác định tần suất báo cáo chi phí, xác định nguồn tài nguyên cần thiết (con người, thiết bị, vật tư) và số lượng để thực hiện dự án. Liệt kê thành danh sách tài nguyên cụ thể, kế hoạch tài nguyên sẽ phụ thuộc vào bản chất riêng của từng dự án và tổ chức thực hiện dự án đó.",
          "keywords": ["đơn vị đo lường", "ngưỡng biến động", "tần suất báo cáo", "nguồn tài nguyên", "kế hoạch tài nguyên"]
        },
        {
          "title": "Ước lượng chi phí",
          "content":"",
          "keywords":["ước lượng chi phí"],
          "subheadings": [
            {
              "title": "Các loại ước lượng chi phí",
              "content": "Phỏng đoán, ngân sách, xác định.",
              "keywords": ["ước lượng chi phí", "phỏng đoán", "ngân sách", "xác định"]
            },
            {
              "title": "Các phương pháp để ước lượng chi phí dự án",
              "content":"",
              "keywords":"phương pháp ước lượng chi phí",
              "subsubheadings": [
                {
                  "title": "Tương tự hay ước lượng từ trên xuống",
                  "content": "Sử dụng chi phí thực tế trước đó của các dự án tương tự làm nền tảng cơ bản để làm ước tính cho dự án hiện tại.",
                  "keywords": ["ước lượng từ trên xuống", "chi phí thực tế", "dự án tương tự"]
                },
                {
                  "title": "Từ dưới lên",
                  "content": "Ước tính riêng từng nhóm và tính toán con số tổng cộng.",
                  "keywords": ["ước lượng từ dưới lên", "ước tính", "tổng cộng"]
                },
                {
                  "title": "Ước lượng 3 trường hợp",
                  "content": "Ước lượng chi phí cho các trường hợp tốt nhất, xấu nhất, và trung bình.",
                  "keywords": ["ước lượng 3 trường hợp", "tốt nhất", "xấu nhất", "trung bình"]
                },
                {
                  "title": "Mô hình tham số",
                  "content": "Sử dụng các đặc điểm riêng biệt trong dự án áp dụng phương thức toán học để ước tính chi phí. Mô hình COCOMO (Constructive Cost Model) là mô hình thông dụng.",
                  "keywords": ["mô hình tham số", "phương thức toán học", "ước tính chi phí", "mô hình COCOMO"]
                }
              ]
            }
          ]
        },
        {
          "title": "Dự toán chi phí",
          "content": "Phân bổ chi phí về các nguồn tài nguyên và các hạng mục công việc cụ thể theo thời gian. Đầu ra quan trọng là cost baseline cho việc kiểm soát chi phí dự án.",
          "keywords": ["dự toán chi phí", "phân bổ chi phí", "nguồn tài nguyên", "cost baseline", "kiểm soát chi phí"]
        },
        {
          "title": "Kiểm soát và điều chỉnh chi phí",
          "content": "Giám sát việc thực thi về chi phí để phát hiện những điều khác biệt với kế hoạch. Bảo đảm rằng tất cả những thay đổi hợp lý đều phải được ghi nhận vào cost baseline một cách chính xác. Ngăn chặn những thay đổi không đúng, không thích hợp và những thay đổi trái phép. Thông báo sự thay đổi đến những người liên quan có thẩm quyền.",
          "keywords": ["kiểm soát chi phí", "giám sát", "cost baseline", "thay đổi"]
        },
        {
          "title": "EVM (Earned Value Management)",
          "content":"",
          "keywords":"EVM",
          "subheadings": [
            {
              "title": "Khái niệm",
              "content": "EVM là một kỹ thuật đo lường sự thực hiện dự án thông qua việc tích hợp dữ liệu của phạm vi, thời gian và chi phí dự án. Đưa ra mốc chi phí (Cost Baseline), người QL cần phải xác định cách tốt nhất mà dự án đạt được mục tiêu. Cần có những thông tin chính xác định kỳ để so sánh với baseline. Từ đó định ra chi phí thực sự cần bao nhiêu để hoàn thành công việc. Sử dụng EVM để: Báo cáo tiến độ dự án, báo cáo hiện trạng ngân sách đã sử dụng, dự đoán tiến triển trong tương lai.",
              "keywords": ["EVM", "kỹ thuật đo lường", "phạm vi", "thời gian", "chi phí", "cost baseline", "tiến độ dự án", "ngân sách"]
            },
            {
              "title": "Các thuật ngữ",
              "content":"",
              "keywords":["BAC","PV","EV","AC","CV","CPI","SV","SPI","EAC","ETC","VAC","TCPI"],
              "subsubheadings": [
                {
                  "title": "Budget at Completion (BAC) – Ngân sách khi hoàn thành",
                  "content": "Tổng kinh phí được phân bố cho dự án.",
                  "keywords": ["BAC", "ngân sách khi hoàn thành", "kinh phí", "dự án"]
                },
                {
                  "title": "Planned Value (PV) – Giá trị kế hoạch",
                  "content": "Tổng chi phí công việc được lên lịch tính đến ngày báo cáo.",
                  "keywords": ["PV", "giá trị kế hoạch", "chi phí công việc", "ngày báo cáo"]
                },
                {
                  "title": "Earned Value (EV) – Giá trị thu được",
                  "content": "Tổng chi phí của công việc đã hoàn thành tính đến ngày báo cáo.",
                  "keywords": ["EV", "giá trị thu được", "chi phí công việc", "ngày báo cáo"]
                },
                {
                  "title": "Actual Cost (AC) – Chi phí thực thế",
                  "content": "Chi phí thực tế của công việc đã thực hiện.",
                  "keywords": ["AC", "chi phí thực tế", "công việc"]
                },
                {
                  "title": "Cost Variance (CV) – Phương sai chi phí",
                  "content": "Là yếu tố quan trọng để đo lường hiệu quả hoạt động của dự án. CV dương thì dự án dưới ngân sách, CV âm thì dự án vượt quá ngân sách.",
                  "keywords": ["CV", "phương sai chi phí", "hiệu quả hoạt động", "dự án", "ngân sách"]
                },
                {
                  "title": "Cost Performance Index (CPI) – Chỉ số hiệu suất chi phí",
                  "content": "Là chỉ số thể hiện hiệu quả sử dụng các nguồn lực của dự án. CPI lớn hơn một: hiệu quả sử dụng các nguồn lực được phân bổ dự án tốt, CPI nhỏ hơn một: hiệu quả sử dụng các nguồn lực được phân bổ cho dự án chưa tốt.",
                  "keywords": ["CPI", "chỉ số hiệu suất chi phí", "hiệu quả sử dụng", "nguồn lực", "dự án"]
                },
                {
                  "title": "Schedule Variance (SV) – Phương sai lịch",
                  "content": "Cho biết dự án đang thực hiện trước hay sau tiến độ lập lịch. SV dương: vượt tiến độ, SV âm: chậm tiến độ.",
                  "keywords": ["SV", "phương sai lịch", "tiến độ", "dự án"]
                },
                {
                  "title": "Schedule Performance Index (SPI) – Chỉ số thực hiện lịch",
                  "content": "Chỉ số thể hiện hiệu quả của thời gian được sử dụng trong dự án. SPI lớn hơn 1: sử dụng thời gian hiệu quả. SPI nhỏ hơn 1: sử dụng thời gian kém hiệu quả.",
                  "keywords": ["SPI", "chỉ số thực hiện lịch", "hiệu quả", "thời gian", "dự án"]
                },
                {
                  "title": "Estimate at completion (EAC) – Ước tính khi hoàn thành",
                  "content": "Ước tính chi phí của dự án khi kết thúc.",
                  "keywords": ["EAC", "ước tính khi hoàn thành", "chi phí", "dự án"]
                },
                {
                  "title": "Estimate to completion (ETC) – Ước tính để hoàn thành",
                  "content": "Ước tính chi phí để hoàn thành phần còn lại của dự án.",
                  "keywords": ["ETC", "ước tính để hoàn thành", "chi phí", "dự án"]
                },
                {
                  "title": "Variance at completion (VAC) – Phương sai khi hoàn thành",
                  "content": "Phương sai trên tổng ngân sách khi kết thúc dự án.",
                  "keywords": ["VAC", "phương sai khi hoàn thành", "ngân sách", "dự án"]
                },
                {
                  "title": "To-Complete Performance Index (TCPI) – Chỉ số hiệu suất chi phí để hoàn thành",
                  "content": "Chỉ số cho thấy hiệu quả mà thời gian còn lại của dự án sẽ được sử dụng.",
                  "keywords": ["TCPI", "chỉ số hiệu suất chi phí", "hoàn thành", "hiệu quả", "thời gian", "dự án"]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Quản lý rủi ro",
      "headings": [
        {
          "title": "Khái niệm rủi ro",
          "content":"",
          "keywords":["khái niệm rủi ro"],
          "subheadings": [
            {
              "title": "Rủi ro",
              "content": "Rủi ro xem như khả năng xảy ra mất mát, tổn thương ngoài ý muốn, hoặc những tình huống phải chấp nhận, rủi ro luôn tiềm ẩn trong dự án, làm ngăn cản sự thành công, thậm chí có thể làm thất bại hoàn toàn dự án, rủi ro càng cao thì dự án càng có lợi nhuận cao. Đối với dự án CNTT thì thường mức rủi ro khá cao. Mọi dự án đều có rủi ro và cơ hội thành công.",
              "keywords": ["rủi ro", "dự án", "CNTT", "mất mát", "tổn thương", "thành công"]
            },
            {
              "title": "Quản lý rủi ro",
              "content": "Quản lý rủi ro là quá trình phát hiện, phân tích, xử lý và kiểm soát các rủi ro có thể có trong một dự án. Quản lý rủi ro không đảm bảo sự thành công mà chỉ làm tăng khả năng thành công của dự án. Mục đích của QL rủi ro là giảm thiểu khả năng rủi ro. Quản lý rủi ro gồm 4 giai đoạn: Xác định (nhận diện) rủi ro, phân tích rủi ro, lập kế hoạch hạn chế, khắc phục, Kiểm soát rủi ro",
              "keywords": ["quản lý rủi ro", "phát hiện", "phân tích", "xử lý", "kiểm soát", "giảm thiểu"]
            }
          ]
        },
        {
          "title": "Quy trình quản lý rủi ro",
          "content":"",
          "keywords":["quy trình","quản lý rủi ro"],
          "subheadings": [
            {
              "title": "Xác định rủi ro",
              "content":"", 
              "keywords":["xác định","rủi ro"],
              "subsubheadings": [
                {
                  "title": "Tầm quan trọng của xác định rủi ro",
                  "content": "Công việc đầu tiên và quan trọng nhất trong quản lý rủi ro là nhận biết điều gì có thể dẫn tới sai sót. Liệt kê danh sách các đối tượng rủi ro có thể ảnh hưởng đến sự thành công của dự án. Một số kỹ thuật nhận diện rủi ro: Phát huy trí tuệ dân chủ (Brainstorming), hỏi chuyên gia (Kỹ thuật Delphi), phỏng vấn từ những kinh nghiệm, rủi ro đã gặp trước đó. Dự án CNTT thường có những rủi ro phổ biến như: Thiếu sự liên kết với khách hàng, thiếu sự hỗ trợ của quản lý, các yêu cầu không rõ ràng, kế hoạch nghèo nàn, thị trường, tài chính, kỹ thuật, tầm nhìn và mục tiêu.",
                  "keywords": ["xác định rủi ro", "quản lý rủi ro", "phát huy trí tuệ dân chủ", "Brainstorming", "Delphi", "phỏng vấn", "CNTT"]
                },
                {
                  "title": "Một số tình huống có thể gây rủi ro",
                  "content": "Các tình huống rủi ro chung: Nhân viên kỹ thuật không thích hợp, môi trường làm việc không thích hợp, tài nguyên do bên thứ 3 cung cấp, rút ngắn thời gian thực hiện dự án. Các tình huống rủi ro tài chính: Người dùng không nêu rõ những gì mà họ muốn, thiết kế và phương pháp lập trình không tốt, sai sót trong ước lượng. Các tình huống rủi ro kỹ thuật: Giải pháp sai, yêu cầu/đặc tả không tốt, không hiểu biết về người dùng.",
                  "keywords": ["tình huống rủi ro", "nhân viên kỹ thuật", "môi trường làm việc", "tài nguyên", "rủi ro tài chính", "thiết kế", "lập trình", "ước lượng", "rủi ro kỹ thuật", "giải pháp", "yêu cầu", "đặc tả"]
                }
              ]
            },
            {
              "title": "Phân tích rủi ro",
              "content":"", 
              "keywords":["phân tích","rủi ro"],
              "subsubheadings": [
                {
                  "title": "Định tính",
                  "content": "Đánh giá xác suất xuất hiện (thấp, vừa, cao) và mức độ tác động (thường, nghiêm trọng, rất nghiêm trọng). Sắp xếp thứ tự ưu tiên: Độ ưu tiên = xác suất * tác động. Loại đi các rủi ro ít xảy ra hay tác động đến dự án là không đáng kể.",
                  "keywords": ["phân tích rủi ro", "định tính", "xác suất", "tác động", "độ ưu tiên"]
                },
                {
                  "title": "Định lượng",
                  "content": "Theo sau phân tích tích chất rủi ro. Hai giai đoạn có thể thực hiện đồng thời hoặc riêng lẻ. Những dự án phức tạp, quy mô lớn, sử dụng các công nghệ tiên tiến thường yêu cầu phân tích định lượng. Một số kỹ thuật chính: Kỹ thuật Phân tích và mô hình hóa như dùng cây quyết định và EMV, mô phỏng rủi ro, kỹ thuật tham khảo ý kiến chuyên gia. Cây quyết định là phương pháp dùng sơ đồ giúp lựa chọn hành động tốt nhất trong các trường hợp cho kết quả không chắc chắn trong tương lai. Expected Monetary Value (EMV): giá trị lợi nhuận mong đợi, được tính dựa trên xác suất xảy ra rủi ro và giá trị tiền tệ.",
                  "keywords": ["phân tích rủi ro", "định lượng", "dự án phức tạp", "công nghệ tiên tiến", "kỹ thuật phân tích", "mô hình hóa", "cây quyết định", "EMV", "mô phỏng rủi ro", "chuyên gia"]
                }
              ]
            },
            {
              "title": "Lập kế hoạch đối phó",
              "content": "Giúp ta giảm bớt ảnh hưởng của rủi ro, chọn chiến lược đáp ứng các rủi ro ưu tiên cao. Một số chiến lược đối phó rủi ro: Tránh xa rủi ro: lựa chọn một phương án khác. Có thể nảy sinh rủi ro khác; Chấp nhận rủi ro: chấp nhận kết quả nếu rủi ro xảy ra; Chuyển rủi ro đi nơi khác; Làm giảm nguyên nhân gây rủi ro: tìm nguyên nhân để hạn chế hoặc loại bỏ. Một số rủi ro và giải pháp: Nhân sự: Nghỉ việc • Làm việc theo nhóm • Đào tạo bổ sung. Công nghệ: Công nghệ mới • Tìm chuyên gia trợ giúp • Thuê công ty chuyên dụng. Yêu cầu: thiếu, sai chức năng • Phân tích kỹ tổ chức/mô hình nghiệp vụ của khách • Làm bản mẫu. Nhà cung cấp: Chất lượng không đảm bảo • Chọn nhà cung cấp thích hợp • Kiểm soát chặt chẽ thực hiện hợp đồng. Yêu cầu: thêm & thay đổi • Áp dụng thiết kế hướng đối tượng, mẫu • Phát triển mô hình soắn ốc • Hợp đồng chặt chẽ. Rủi ro khác: hỏng thiết bị, mất dữ liệu • Lập dự phòng.",
              "keywords": ["lập kế hoạch đối phó", "chiến lược", "tránh xa rủi ro", "chấp nhận rủi ro", "chuyển rủi ro", "giảm nguyên nhân", "giải pháp", "nhân sự", "công nghệ", "yêu cầu", "nhà cung cấp", "rủi ro khác"]
            },
            {
              "title": "Kiểm soát rủi ro",
              "content": "Thu nhận thông tin, đánh giá khả năng thực tế xảy ra của rủi ro cũ, mới. Đánh giá lại mức tác động, sắp hạng. Chuẩn bị kế hoạch đáp ứng rủi ro mới, kiểm tra dữ liệu quản lý hiện có. Thảo luận các rủi ro chính, quan trọng để đi đến áp dụng giải pháp nếu cần thiết. Loại bỏ rủi ro đã qua hay có độ ưu tiên thấp. Lặp lại các hoạt động của tiến trình ở mỗi mốc lớn hoặc từ 6 đến 9 tuần, hoặc ở đầu một pha mới. Vẫn kiểm soát khi có rủi ro xảy ra. Nếu cần thiết, công bố dự án bị kéo dài về thời gian hoặc thêm chi phí và báo cáo rõ nguyên nhân của vấn đề.",
              "keywords": ["kiểm soát rủi ro", "đánh giá", "sắp hạng", "kế hoạch đáp ứng", "dữ liệu quản lý", "giải pháp", "loại bỏ rủi ro", "tiến trình", "pha mới", "dự án kéo dài", "thêm chi phí"]
            }
          ]
        }
      ]
    },
    {
      "title": "Quản lý chất lượng",
      "headings": [ 
        {
        "title": "Khái niệm",
        "content": "Chất lượng là một sự tổng hợp tất cả các đặc tính của một sản phẩm mà có khả năng thỏa mãn mọi yêu cầu về sản phẩm đó (ISO). Một số chuyên gia định nghĩa chất lượng dựa trên mức độ đáp ứng của sản phẩm và sự phù hợp khi sử dụng. Sản phẩm đáp ứng được các yêu cầu, Có đủ các chức năng như quy định.",
        "keywords": ["khái niệm chất lượng", "ISO"],
        "subheadings": [
          {
            "title": "Tầm quan trọng của quản lý chất lượng",
            "content": "Đảm bảo dự án thỏa mãn mọi yêu cầu đã đề ra. Khách hàng là người cuối cùng đánh giá sản phẩm. Nhiều dự án thất bại do chỉ chú tâm đến kỹ thuật, mà không quan tâm đến mong đợi của khách hàng. Vấn đề chất lượng phải được xem ngang hàng với phạm vi dự án, thời gian thực hiện và chi phí.",
            "keywords": ["tầm quan trọng của quản lý chất lượng", "khách hàng"]
          },
          {
            "title": "Mối liên hệ giữa quản lý chất lượng và quản lý phạm vi",
            "content": "Quản lý phạm vi: xác định các ranh giới, yêu cầu của dự án, đảm bảo sự rõ ràng và sự phù hợp với kỳ vọng của các bên liên quan. Quản lý chất lượng: đảm bảo rằng các đầu ra của dự án đáp ứng các tiêu chuẩn đã được xác định, đảm bảo thành công của dự án. Nếu không có quản lý phạm vi rõ ràng, việc xác định tiêu chuẩn chất lượng sẽ gặp khó khăn, và nếu thiếu quản lý chất lượng, ngay cả phạm vi đã được định rõ ràng cũng có thể không dẫn đến kết quả hài lòng cho dự án.",
            "keywords": ["mối liên hệ giữa quản lý chất lượng và phạm vi", "tiêu chuẩn chất lượng"]
          }
        ]
      },
      {
        "title": "Quy trình quản lý chất lượng",
        "content": "Quản lý chất lượng gồm 3 quy trình:\n-Lập kế hoạch quản lý chất lượng\n-Thực hiện đảm bảo chất lượng\n-Kiểm soát chất lượng",
        "keywords": ["quy trình quản lý chất lượng"],
        "subheadings": [
          {
            "title": "Lập kế hoạch quản lý chất lượng",
            "content": "Là quy trình xác định yêu cầu chất lượng và/hoặc tiêu chuẩn chất lượng của dự án và các sản phẩm bàn giao. Lập tài liệu về việc dự án sẽ thực hiện như thế nào để đạt được các yêu cầu chất lượng. Lợi ích của quy trình này là cung cấp hướng dẫn và định hướng cho việc chất lượng sẽ được quản lý và công nhận như thế nào trong suốt dự án. Việc kết hợp tất cả các tiêu chuẩn chất lượng trong thiết kế dự án là mấu chốt quan trọng nhất trong quản lý chất lượng. Trong dự án CNTT, các tiêu chuẩn chất lượng cho phép hệ thống mở rộng và nâng cấp, đặt ra thời lượng thích hợp nhất để hệ thống xử lý dữ liệu và bảo đảm hệ thống cho kết quả chính xác và nhất quán.",
            "keywords": ["lập kế hoạch quản lý chất lượng", "tiêu chuẩn chất lượng", "dự án CNTT"]
          },
          {
            "title": "Thực hiện đảm bảo chất lượng",
            "content": "Đánh giá toàn bộ hoạt động của dự án nhằm đảm bảo dự án có thể thỏa mãn những tiêu chuẩn chất lượng có liên quan. Quy định rõ trách nhiệm về mặt chất lượng trong suốt quá trình thực hiện dự án. Lợi ích của quy trình này là nhằm cải tiến việc thực hiện dự án ở hiện tại hay những dự án trong tương lai.",
            "keywords": ["thực hiện đảm bảo chất lượng", "đánh giá hoạt động dự án"]
          },
          {
            "title": "Kiểm soát chất lượng",
            "content": "Là quy trình giám sát và kiểm tra các kết quả cụ thể của dự án nhằm đánh giá dự án có tuân thủ các quy định chất lượng hay không. Đồng thời đề nghị các cách đề cải thiện chất lượng. Lợi ích của quy trình này là: -Nhằm xác định nguyên nhân của các quy trình kém hay sản phẩm kém chất lượng để có hành động loại bỏ chúng -Công nhận các sản phẩm bàn giao và các công việc đã đạt được các yêu cầu của các bên liên quan để nghiệm thu dự án. Kết quả thu được của quá trình này: -Các quyết định chấp nhận (Acceptance decisions) -Làm lại (Rework) -Sửa đổi quy trình (Process adjustments)",
            "keywords": ["kiểm soát chất lượng", "giám sát kết quả", "cải thiện chất lượng"]
          }
        ]
      },
      {
        "title": "Các công cụ và kỹ thuật quản lý chất lượng",
        "content": "",
        "keywords": ["công cụ quản lý chất lượng", "kỹ thuật quản lý chất lượng"],
        "subheadings": [
          {
            "title": "Seven Basic Tools",
            "content": "",
            "keywords": ["Seven Basic Tools"],
            "subsubheadings": [
              {
                "title": "Biểu đồ nguyên nhân kết quả (xương cá)",
                "content": "Có dạng 5M1E với 6 yếu tố: nguyên nhiên vật liệu, con người, môi trường, máy móc thiết bị, phương pháp và đo lường. Áp dụng 5P với 5 yếu tố: Product, Price, People, Place và Process. Mục đích: xác định nguyên nhân, tìm hiểu lý do để giải quyết các khó khăn, nhu cầu nhận diện các lĩnh vực IT, tìm hiểu nguyên nhân không đưa ra đúng kết quả.",
                "keywords": ["biểu đồ xương cá", "5M1E", "5P"]
              },
              {
                "title": "Biểu đồ kiểm soát",
                "content": "Là đồ thị đường gấp khúc biểu diễn giá trị trung bình của đặc tính, tỷ lệ khuyết tật hoặc số khuyết tật. Dùng kiểm tra sự bất thường dựa trên những thay đổi của các đặc tính kiểm soát. Có 3 loại biểu đồ kiểm soát: Biểu đồ trung bình (X-bar chart), Biểu đồ độ rộng (R chart) và Biểu đồ độ lệch chuẩn (S chart). Mục đích: giám sát độ biến thiên, dự tính trung bình hoặc độ biến thiên (mức độ phân tán trong biểu đồ histogram), đánh giá những tác nhân làm ảnh hưởng đến nỗ lực cải tiến liên tục.",
                "keywords": ["biểu đồ kiểm soát", "X-bar chart", "R chart", "S chart"]
              },
              {
                "title": "Phiếu kiểm soát (checksheet)",
                "content": "Là một biểu mẫu đơn giản, trực quan, được dùng để thu thập dữ liệu. Được thiết kế và tuỳ chỉnh bởi người sử dụng sao cho phù hợp với mục đích thu thập. Là cơ sở để lưu hồ sơ và dữ liệu để phân tích thống kê. Mục đích: thu thập dữ liệu về số lượng hoặc tần suất xuất hiện các vấn đề liên quan; sử dụng như phiếu ghi chép giúp ghi nhận lại dữ liệu, phân loại các hạng mục khác nhau; kiểm tra, xác nhận công việc để phòng ngừa xảy ra sự cố hay sai sót.",
                "keywords": ["phiếu kiểm soát", "checksheet", "thu thập dữ liệu"]
              },
              {
                "title": "Biểu đồ phân tán (scatter diagram)",
                "content": "Là biểu đồ giúp xác định mối liên hệ giữa hai biến số. Hiển thị giá trị của hai biến được vẽ dọc theo hai trục của biểu đồ. Mô hình của các điểm kết quả sẽ tiết lộ mối tương quan giữa chúng. Mục đích: để xác nhận mối quan hệ giữa nguyên nhân và kết quả; hiểu nguyên nhân của hiệu suất kém.",
                "keywords": ["biểu đồ phân tán", "scatter diagram", "mối tương quan"]
              },
              {
                "title": "Biểu đồ tần suất (histogram)",
                "content": "Là 1 dạng biểu đồ thể hiện tần suất dạng cột. Biểu thị phân bố đặc tính chất lượng sản phẩm. Mục đích: dùng thống kê để phân bổ vùng dữ liệu từ đó đưa ra những kết luận phù hợp để cải tiến và nâng cao chất lượng; ngoài ra còn cho biết 4 vấn đề như giá trị thường xuyên xuất hiện nhiều nhất, mức độ xuất hiện của mỗi giá trị, hình dạng của phân bổ giá trị, mối quan hệ giữa các dữ liệu.",
                "keywords": ["biểu đồ tần suất", "histogram", "phân bố đặc tính"]
              },
              {
                "title": "Biểu đồ Pareto",
                "content": "Là biểu đồ hình cột với các số liệu được sắp xếp sẵn từ thấp đến cao. Các số liệu sẽ phản ảnh lại các dữ liệu được thu thập chính xác nhất giúp giải quyết vấn đề. Mục đích: hỗ trợ phân loại yếu tố và vấn đề cần giải quyết trước, giúp đánh giá và nâng cao hiệu suất công việc; tối ưu hoá quá trình gia tăng năng suất; quản trị rủi ro hiệu quả, đảm bảo đề xuất những giải pháp đúng đắn; xác định hướng phát triển bền vững.",
                "keywords": ["biểu đồ Pareto", "phân loại yếu tố", "quản trị rủi ro"]
              },
              {
                "title": "Biểu đồ flowchart",
                "content": "Là một biểu diễn dạng sơ đồ minh hoạ trình tự các hoạt động được thực hiện để có được kết quả mong muốn và nó còn được gọi là sơ đồ dòng chảy quy trình. Mục đích: theo dõi quy trình, nêu bật các bước quan trọng, mô tả cấu trúc quy trình, sơ đồ hoá dễ nắm bắt quy trình hệ thống.",
                "keywords": ["biểu đồ flowchart", "sơ đồ dòng chảy quy trình"]
              }
            ]
          },
          {
            "title": "Six sigma",
            "content": "Six Sigma (6 Sigma, hay 6σ) là một hệ phương pháp cải tiến quy trình kinh doanh và quản lý chất lượng bằng cách dựa trên thống kê để tìm ra lỗi (khuyết tật), xác định nguyên nhân của lỗi và xử lý lỗi nhằm làm tăng độ chính xác của quy trình do hãng Motorola phát triển đầu tiên năm 1985. Ý nghĩa: giảm tỉ lệ sai sót kĩ thuật, loại trừ các nguồn tạo nên dao động (bất ổn) trong quá trình kinh doanh, tập trung vào việc thông hiểu nhu cầu của khách hàng. Lợi ích của Six sigma: chi phí sản xuất giảm, chi phí quản lý giảm, thời gian chu trình giảm, sự hài lòng của khách hàng gia tăng, mở rộng sản xuất dễ dàng hơn.",
            "keywords": ["Six Sigma", "cải tiến quy trình", "quản lý chất lượng", "Motorola"]
          }
        ]
      }
    ]
    }
]
}